openfoam2/OpenFOAM-2.3.x/tutorials/combustion/fireFoam/les/oppositeBurningPanels/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    };

    "(rho)Final"
    {
        $rho;
        relTol          0;
    }

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-6;
        relTol              0.01;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    };

    p_rghFinal
    {
        $p_rgh;
        tolerance           1e-6;
        relTol              0;
    };


    "(U|Yi|k|h|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
        nSweeps         1;
    };

    "(U|Yi|k|h|omega)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    };


    Ii
    {
        solver                  GAMG;
        tolerance               1e-4;
        relTol                  0;
        smoother                symGaussSeidel;
        cacheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;
        maxIter                 1;
        nPreSweeps              0;
        nPostSweeps             1;
    }

    "(G)Final"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-04;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        "(U|k).*"                   1;
        "(C3H8|O2|H2O|CO2|h).*"     1;
    }
}

// ************************************************************************* //
